# Alexis Oduro-Domfe

## Research question/interests

I’m interested in this data set and analyzing the questions of what factors are indicative of a person’s credit score, how this can be used as reference model for credit card applicants? And why it is a important

In [7]:
import pandas as pd
# a= eval(r.content) Never user eval for online texts
df = pd.read_csv('../data/raw/application_record.csv')
df

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438552,6840104,M,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,-22717,365243,1,0,0,0,NaN,1
438553,6840222,F,N,N,0,103500.0,Working,Secondary / secondary special,Single / not married,House / apartment,-15939,-3007,1,0,0,0,Laborers,1
438554,6841878,F,N,N,0,54000.0,Commercial associate,Higher education,Single / not married,With parents,-8169,-372,1,1,0,0,Sales staff,1
438555,6842765,F,N,Y,0,72000.0,Pensioner,Secondary / secondary special,Married,House / apartment,-21673,365243,1,0,0,0,NaN,2
438556,6842885,F,N,Y,0,121500.0,Working,Secondary / secondary special,Married,House / apartment,-18858,-1201,1,0,1,0,Sales staff,2

## Milestone 3

### Task 1 - Conduct an EDA

In [8]:
import numpy as np
import pandas as pd
import seaborn as sns #Understanding the variables
import matplotlib.pylab as plt

df = pd.read_csv('../data/raw/application_record.csv')
df.info()
print("Number of rows and columns respectively:", df.shape)
print("Columns in the dataset:", df.columns)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  int64
dtypes: float64(1), int64(9), object(8)
memory usage: 60.2+ MB
Number of rows and columns respectively: (438557, 18)
Columns in the dataset: Index(['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN',
       'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE',
       'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS'],
      dtype='object')

#### Summarize object and numeric variables

In [8]:
df.describe().apply(lambda s: s.apply(lambda x: format(x, 'f')))

,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS
count,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000
mean,6022176.269842,0.427390,187524.286010,-15997.904649,60563.675328,1.000000,0.206133,0.287771,0.108207,2.194465
std,571637.023257,0.724882,110086.853066,4185.030007,138767.799647,0.000000,0.404527,0.452724,0.310642,0.897207
min,5008804.000000,0.000000,26100.000000,-25201.000000,-17531.000000,1.000000,0.000000,0.000000,0.000000,1.000000
25%,5609375.000000,0.000000,121500.000000,-19483.000000,-3103.000000,1.000000,0.000000,0.000000,0.000000,2.000000
50%,6047745.000000,0.000000,160780.500000,-15630.000000,-1467.000000,1.000000,0.000000,0.000000,0.000000,2.000000
75%,6456971.000000,1.000000,225000.000000,-12514.000000,-371.000000,1.000000,0.000000,1.000000,0.000000,3.000000
max,7999952.000000,19.000000,6750000.000000,-7489.000000,365243.000000,1.000000,1.000000,1.000000,1.000000,20.000000

In [9]:
df.describe(include='object').T

                      count unique                            top    freq
CODE_GENDER          438557      2                              F  294440
FLAG_OWN_CAR         438557      2                              N  275459
FLAG_OWN_REALTY      438557      2                              Y  304074
NAME_INCOME_TYPE     438557      5                        Working  226104
NAME_EDUCATION_TYPE  438557      5  Secondary / secondary special  301821
NAME_FAMILY_STATUS   438557      5                        Married  299828
NAME_HOUSING_TYPE    438557      6              House / apartment  393831
OCCUPATION_TYPE      304354     18                       Laborers   78240

### Clean Data

In [9]:
df_cleaned = df.copy().drop(['FLAG_OWN_REALTY', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE',
       'FLAG_EMAIL', 'OCCUPATION_TYPE'], axis=1)
df_cleaned

,ID,CODE_GENDER,FLAG_OWN_CAR,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,2
1,5008805,M,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,2
2,5008806,M,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,2
3,5008808,F,N,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1
4,5008809,F,N,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1
...,...,...,...,...,...,...,...,...,...,...
438552,6840104,M,N,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,1
438553,6840222,F,N,0,103500.0,Working,Secondary / secondary special,Single / not married,House / apartment,1
438554,6841878,F,N,0,54000.0,Commercial associate,Higher education,Single / not married,With parents,1
438555,6842765,F,N,0,72000.0,Pensioner,Secondary / secondary special,Married,House / apartment,2
438556,6842885,F,N,0,121500.0,Working,Secondary / secondary special,Married,House / apartment,2

In [10]:
# Check for duplicated entries:

if len(df_cleaned[df_cleaned.duplicated()]) > 0:
    print("No. of duplicated entries: ", len(df_cleaned[df_cleaned.duplicated()]))
    print(df_cleaned[df_cleaned.duplicated(keep=False)].sort_values(by=list(df_cleaned.columns)).head())
else:
    print("No duplicated entries found")

No duplicated entries found

In [4]:
from scipy.stats import zscore
from scipy import stats

In [2]:
# Check for outliers

z_scores = stats.zscore(df_cleaned)

# calculate z-scores of `df`

abs_z_scores = np.abs(z_scores)

filtered_entries = (abs_z_scores < 3).all(axis=1)

new_df = df_cleaned[filtered_entries]

new_df

NameError: name 'stats' is not defined

In [17]:
def load_and_process(url_or_path_to_csv_file):

    # Method Chain 1 (Load data and deal with missing data)

    df1 = (
          pd.read_csv('../data/raw/application_record.csv')
          .rename(columns={'CODE_GENDER': 'gender', 'CNT_CHILDREN': 'children', 'AMT_INCOME_TOTAL': 'income',
                          'NAME_INCOME_TYPE': 'employment_type', 'NAME_EDUCATION_TYPE': 'education_level', 'NAME_FAMILY_STATUS': 'relationship_status',
                          'NAME_HOUSING_TYPE': 'Housing', 'CNT_FAM_MEMBERS': 'family_members'})
          .fillna("Inconlusive")
        
    )

    # Method Chain 2 (Create new columns, drop others, and do processing)
    
    df2 = (
          df1.drop(['FLAG_OWN_REALTY', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE',
       'FLAG_EMAIL', 'OCCUPATION_TYPE'], axis=1)
    )

    # Make sure to return the latest dataframe

    return df2